
#+PROPERTY: header-args:jupyter-python+ :session karlsson_2021
#+PROPERTY: header-args:bash+ :session (concat "*" (nth 1 (reverse (split-string default-directory "/"))) "-shell*")

* Introduction

** Data

*** Printout

#+BEGIN_SRC bash :exports both :results verbatim
ncdump -h ./dat/GL_basal_melt_3413.nc | grep -vE 'coordinates|_Fill|spatial_ref'
#+END_SRC

* Processing
** Provenance

+ Paper: Karlsson (2021) http://doi.org/10.1038/s41467-021-23739-z 
+ Data: Karlsson (2021; v2) http://doi.org/https://doi.org/10.22008/FK2/PLNUEO
  
** Load data

*** Mouginot regions
#+BEGIN_SRC bash :exports both :results verbatim
grass G_3413/PERMANENT
g.mapset -c K2021

ogr2ogr ./tmp/Mouginot.gpkg -t_srs "EPSG:3413" ${DATADIR}/Mouginot_2019/Greenland_Basins_PS_v1.4.2.shp
v.import input=./tmp/Mouginot.gpkg output=GL_all
# clean
v.db.droprow input=GL_all where='NAME like "ICE_CAPS_%"' output=nocaps
v.dissolve input=nocaps column=SUBREGION1 output=GL_dirty
v.clean input=GL_dirty tool=rmarea thresh=1000 output=GL

g.region vector=GL res=1000
v.to.rast input=GL output=GL_ROI use=cat

r.category GL_ROI sep=: rules=- << EOF
1:CE
2:CW
3:NE
4:NO
5:NW
6:SE
7:SW
EOF

v.to.rast input=nocaps output=GL_TW use=val val=1 where='GL_TYPE == "TW"' # tidewater
v.to.rast input=nocaps output=GL_LT use=val val=1 where='GL_TYPE == "LT"' # land terminating
#+END_SRC

*** Karlsson data

#+BEGIN_SRC bash :exports both :results verbatim
r.in.gdal -o input=NetCDF:${DATADIR}/Karlsson_2021/v2/basalmelt_Karlssonetal2021_updated2022.nc:gfmelt output=gf
r.in.gdal -o input=NetCDF:${DATADIR}/Karlsson_2021/v2/basalmelt_Karlssonetal2021_updated2022.nc:fricmelt output=fric
r.in.gdal -o input=NetCDF:${DATADIR}/Karlsson_2021/v1/basalmelt.nc:vhdmelt output=vhd

r.mapcalc "bm = gf + fric + vhd"
r.mapcalc "bm = bm * area() * exp(10,-9)" # m/m^2/year to Gt/year

r.univar bm | grep sum # 20 Gt/yr

r.mapcalc "bm_TW = bm * GL_TW"
r.mapcalc "bm_LT = bm * GL_LT"
#+END_SRC

#+BEGIN_SRC bash :exports both :results verbatim
echo "Zone to ROI"
r.category GL_ROI

echo "Marine terminating"
r.univar map=bm_TW zones=GL_ROI -t --q | datamash -t"|" transpose | sed '1p;/sum/!d' | grep -v "sum_abs" | datamash -t"|" transpose

echo "Land terminating"
r.univar map=bm_LT zones=GL_ROI -t --q | datamash -t"|" transpose | sed '1p;/sum/!d' | grep -v "sum_abs" | datamash -t"|" transpose
#+END_SRC

#+RESULTS:
#+begin_example
Zone to ROI
1	CE
2	CW
3	NE
4	NO
5	NW
6	SE
7	SW

Marine terminating
zone|sum
1|1.84838820241839
2|3.54635563288619
3|2.72091056955882
4|1.3417241585168
5|3.3788643743091
6|3.27648377843297
7|1.16053226850285

Land terminating
zone|sum
1|0.000253509933951308
2|0.376131368040758
3|0.0568426908419613
4|0.050381314906258
5|0.0408799397071217
6|0.012403755806213
7|2.08325971027129
#+end_example
